1password
alfred
atom
backblaze
bartender
daisydisk
dash
deluge
dropbox
evernote
fantastical
firefox
flux
google-chrome
iterm2
kaleidoscope
kap
moom
numi
omnifocus
phpstorm
sequel-pro
skitch
slack
sourcetree
spotify
textexpander
transmit
visual-studio-code
xscope
