tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Get/set bluetooth power and discoverable state
brew "blueutil"

# Command-line tool to interact with exercism.io
brew "exercism"

# Play, record, convert, and stream audio and video
brew "ffmpeg"

# Open source programming language to build simple/reliable/efficient software
brew "go"

# GitHub Markdown previewer
brew "grip"

# Sophisticated file transfer program
brew "lftp"

# Disk space visualizer
cask "daisydisk"

# Voice and text chat software
cask "discord"

# App for note taking, organizing, task lists, and archiving
cask "evernote"

# Access the HEY email service
cask "hey"

# Free and open-source RSS reader
cask "netnewswire"

# Calculator and converter application
cask "numi"

# Retro video game emulation
cask "openemu"

mas "1Blocker", id: 1365531024
mas "Apple Configurator 2", id: 1037126344
mas "Bear", id: 1091189122
mas "Deliveries", id: 290986013
mas "Save to Raindrop.io", id: 1549370672
mas "Todoist", id: 585829637
mas "Tweetbot", id: 1384080005
mas "Twitter", id: 1482454543
